def find_common_elements():
    # Введення першої множини з клавіатури
    set1 = set(map(int, input("Введіть елементи першої множини через пробіл: ").split()))

    # Введення другої множини з клавіатури
    set2 = set(map(int, input("Введіть елементи другої множини через пробіл: ").split()))

    # Виводимо обидві множини
    print("Перша множина:", set1)
    print("Друга множина:", set2)

    # Знаходимо спільні елементи між двома множинами
    common_elements = set1.intersection(set2)

    # Виводимо спільні елементи
    print("Елементи, які входять в обидві множини:", common_elements)

# Виклик функції
find_common_elements()
